{
  "author": "WeiCheng Hung",
  "author-reversed": "洪 瑋成",
  "nav": {
    "about": "About",
    "projects": "Projects",
    "resume": "Resume"
  },
  "home": {
    "hero-content": " I'm a developer with an insatiable curiosity, dedicated to crafting outstanding frontend experiences. My coding journey blends a passion for technology with a commitment to problem-solving. I thrive on collaborating with teams to create captivating products. Here, I unite my technical skills and creativity to deliver a unique and impressive digital experience for you. Let's explore, innovate, and inspire together.",
    "contact-title": "Contact Me",
    "contact-content": "I'm currently looking for full-time opportunities. If you have any questions or would like to get in touch, please feel free to email me at",
    "experience": {
      "title": "Experiences",
      "jobs": [
        {
          "id": 0,
          "title": "Web Developer",
          "company": "Cathay Life Insurance Co., Ltd.",
          "period": "2025/02 - current",
          "description": {
            "brief": "Lead the frontend design and development of the second-generation actuarial system, focusing on modern UI/UX principles, performance optimization, and seamless integration with backend services to enhance user experience and operational efficiency.",
            "details": []
          }
        },
        {
          "id": 1,
          "title": "Frontend Developer",
          "company": "President Information Corp.",
          "period": "2021/10 - 2025/02",
          "description": {
            "brief": "In charge of developing frontend development of Lumine AI",
            "details": [
              "As a Frontend Lead of the AI Team, I am responsible for the backend and chat interface development. Initially assisted in project understanding while the interface was outsourced due to political factors. Provided examples and stacks for the chat interface, but the delivered code, particularly for the backend, was nearly unusable. To address this, I proposed and led a complete rewrite alongside the UX/UI designer within one month, resolving package EOL issues and ensuring successful deployment.",
              "Developed the IOPENMall customer service chatbot. Due to manpower considerations for this project, I was required to step in for backend development. Given that the frontend engineers were proficient in React.js, the project's frontend and backend architecture, along with initial development, were completed using React.js, Typescript, and Socket.io. The project was successfully handed over to the frontend engineers and the Project Manager (PM), and subsequently launched."
            ]
          }
        },
        {
          "id": 2,
          "title": "Part-time Frontend Engineer",
          "company": "Gain Miles Technology Platform Limited",
          "period": "2023/05 - 2023/09",
          "description": {
            "brief": "Develop official website and APP backend website",
            "details": [
              "Fully remote, build Official web site https://www.gumhk.com/zh-HK (Next.js, Typescript, MUI), mobile app backend dashboard (Next.js, Typescript, MUI) with full-stack developer."
            ]
          }
        },
        {
          "id": 3,
          "title": "R&D Substitute",
          "company": "National Taiwan University",
          "period": "2017/08 - 2021/06",
          "description": {
            "brief": "Handle research projects and develop utils of software for lab.",
            "details": [
              "Handle research projects on the topic of 3D shoe painting",
              "Develop lab inventory management system through RFID",
              "Control Six-axis robot arm"
            ]
          }
        },
        {
          "id": 4,
          "title": "Co-founder & Software Developer",
          "company": "Anhe Three Dimensional Corp.",
          "period": "2015/08 - 2017/07",
          "description": {
            "brief": "Develop software for 3D printing.",
            "details": [
              "Algorithm implementation through Java which is refer to Zhang (2015)",
              "Design human interface for inkjet 3D printer with Vaadin and Three.js",
              "Construct internal system with Angular 2, Spring Boot Rest API and using MySQL as data source."
            ]
          }
        }
      ]
    }
  },
  "project": {
    "back-button": "Back to Projects",
    "project-not-found": "Project not found",
    "view-github": "View on Github",
    "view-site": "View on Website"
  },
  "not-found": {
    "content": "Oops! The page you are looking for has been removed or relocated."
  }
}
